üî∑ KONFIGURASI DASAR INTERFACE SERIAL
ciscoF1-ROUTER>en
F1-ROUTER#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
F1-ROUTER(config)#int se0/2/0
F1-ROUTER(config-if)#ip address 10.10.10.5 255.255.255.252
F1-ROUTER(config-if)#exit
F1-ROUTER(config)#int se0/2/1
F1-ROUTER(config-if)#ip address 10.10.10.9 255.255.255.252
F1-ROUTER(config-if)#exit
F1-ROUTER(config)#do write
Building configuration...
[OK]
F1-ROUTER(config)#exit

üî∑ KONFIGURASI VLAN SUBINTERFACES
ciscoF1-ROUTER>en
F1-ROUTER#conf t
Enter configuration commands, one per line.  End with CNTL/Z.

F1-ROUTER(config)#int gig0/0.80
F1-ROUTER(config-subif)#encapsulation dot1Q 80
F1-ROUTER(config-subif)#ip address 192.168.0.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#int gig0/0.70
F1-ROUTER(config-subif)#encapsulation dot1Q 70
F1-ROUTER(config-subif)#ip address 192.168.7.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#int gig0/0.60
F1-ROUTER(config-subif)#encapsulation dot1Q 60
F1-ROUTER(config-subif)#ip address 192.168.6.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#do write
Building configuration...
[OK]
F1-ROUTER(config)#exit

üî∑ KONFIGURASI DHCP
ciscoF1-ROUTER>en
F1-ROUTER#conf t
Enter configuration commands, one per line.  End with CNTL/Z.

F1-ROUTER(config)#service dhcp
F1-ROUTER(config)#ip dhcp pool RECEPTIONIST
F1-ROUTER(dhcp-config)#network 192.168.8.0 255.255.255.0
F1-ROUTER(dhcp-config)#default-router 192.168.8.1
F1-ROUTER(dhcp-config)#dns-server 192.168.8.1
F1-ROUTER(dhcp-config)#exit

F1-ROUTER(config)#ip dhcp pool STORE
F1-ROUTER(dhcp-config)#network 192.168.7.1 255.255.255.0
F1-ROUTER(dhcp-config)#default-router 192.168.7.1
F1-ROUTER(dhcp-config)#dns-server 192.168.7.1
F1-ROUTER(dhcp-config)#exit

F1-ROUTER(config)#ip dhcp pool LOGISTIK
F1-ROUTER(dhcp-config)#network 192.168.6.0 255.255.255.0
F1-ROUTER(dhcp-config)#default-router 192.168.6.1
F1-ROUTER(dhcp-config)#dns-server 192.168.6.1
F1-ROUTER(dhcp-config)#exit

F1-ROUTER(config)#do write
Building configuration...
[OK]
F1-ROUTER(config)#exit

üî∑ KONFIGURASI OSPF
ciscoF1-ROUTER>enable
F1-ROUTER#configure terminal

F1-ROUTER(config)#interface serial0/2/0
F1-ROUTER(config-if)#ip address 10.10.10.5 255.255.255.252
F1-ROUTER(config-if)#clock rate 64000
F1-ROUTER(config-if)#encapsulation ppp
F1-ROUTER(config-if)#no shutdown
F1-ROUTER(config-if)#exit

F1-ROUTER(config)#interface serial0/2/1
F1-ROUTER(config-if)#ip address 10.10.10.9 255.255.255.252
F1-ROUTER(config-if)#clock rate 64000
F1-ROUTER(config-if)#encapsulation ppp
F1-ROUTER(config-if)#no shutdown
F1-ROUTER(config-if)#exit

F1-ROUTER(config)#interface gigabitEthernet0/0
F1-ROUTER(config-if)#no shutdown
F1-ROUTER(config-if)#exit

F1-ROUTER(config)#interface gigabitEthernet0/0.60
F1-ROUTER(config-subif)#encapsulation dot1Q 60
F1-ROUTER(config-subif)#ip address 192.168.6.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#interface gigabitEthernet0/0.70
F1-ROUTER(config-subif)#encapsulation dot1Q 70
F1-ROUTER(config-subif)#ip address 192.168.7.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#interface gigabitEthernet0/0.80
F1-ROUTER(config-subif)#encapsulation dot1Q 80
F1-ROUTER(config-subif)#ip address 192.168.0.1 255.255.255.0
F1-ROUTER(config-subif)#exit

F1-ROUTER(config)#router ospf 10
F1-ROUTER(config-router)#network 10.10.10.4 0.0.0.3 area 0
F1-ROUTER(config-router)#network 10.10.10.8 0.0.0.3 area 0
F1-ROUTER(config-router)#network 192.168.6.0 0.0.0.255 area 0
F1-ROUTER(config-router)#network 192.168.7.0 0.0.0.255 area 0
F1-ROUTER(config-router)#network 192.168.0.0 0.0.0.255 area 0
F1-ROUTER(config-router)#exit
F1-ROUTER(config)#exit

F1-ROUTER#write memory

üî∑ KONFIGURASI SSH
ciscoF1-ROUTER>en
F1-ROUTER#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
F1-ROUTER(config)#ip domain-name hotel
F1-ROUTER(config)#username hotel password hotel@123
F1-ROUTER(config)#crypto key generate rsa
The name for the keys will be: F1-ROUTER.hotel
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

F1-ROUTER(config)#line vty 0 15
F1-ROUTER(config-line)#login local
F1-ROUTER(config-line)#transport input ssh
F1-ROUTER(config-line)#exit
F1-ROUTER(config)#do write
Building configuration...
[OK]
F1-ROUTER(config)#exit

üîß TROUBLESHOOTING GUIDE
1Ô∏è‚É£ Cek Status Interface
ciscoRouter#show ip interface brief
Yang harus dicek:

‚úÖ Status harus up/up (bukan up/down atau down/down)
‚úÖ IP address sudah benar sesuai topologi

Solusi jika down:
ciscoRouter(config)#interface [interface_name]
Router(config-if)#no shutdown
Router(config-if)#exit

2Ô∏è‚É£ Cek OSPF Neighbor
ciscoRouter#show ip ospf neighbor
Yang harus terlihat:

‚úÖ State harus FULL/- atau FULL/DR atau FULL/BDR
‚úÖ Semua neighbor muncul

Solusi jika neighbor tidak muncul:
ciscoRouter(config)#router ospf 10
Router(config-router)#network [network] [wildcard] area 0
Router(config-router)#exit
Cek OSPF process ID harus sama di semua router:
ciscoRouter#show ip protocols

3Ô∏è‚É£ Cek Routing Table
ciscoRouter#show ip route
Yang harus terlihat:

‚úÖ Kode O untuk OSPF routes
‚úÖ Semua network remote harus ada

Solusi jika tidak ada OSPF routes:

Pastikan OSPF neighbor sudah FULL
Pastikan network statement sudah benar


4Ô∏è‚É£ Test Konektivitas
ciscoRouter#ping [IP_address]
Test sequence:

Ping ke interface tetangga langsung (next hop)
Ping ke network remote

Jika ping gagal:
ciscoRouter#traceroute [IP_address]
```

---

### 5Ô∏è‚É£ Masalah Line Protocol Down

**Gejala:**
```
Serial0/1/0 is up, line protocol is down
Penyebab dan Solusi:
A. Clock Rate Belum Di-set (di DCE)
ciscoRouter(config)#interface serial0/x/x
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown
Cek apakah interface adalah DCE:
ciscoRouter#show controllers serial0/x/x
Cari kata "DCE" atau "DTE"
B. Encapsulation Tidak Match
ciscoRouter#show interfaces serial0/x/x | include Encapsulation
Ubah ke PPP jika HDLC bermasalah:
ciscoRouter(config)#interface serial0/x/x
Router(config-if)#encapsulation ppp
Router(config-if)#no shutdown
PENTING: Encapsulation harus sama di kedua sisi (F1 dan F2 harus sama-sama PPP atau HDLC)
C. IP Address Tidak Satu Subnet
Cek subnet dengan kalkulator:

10.10.10.8/30 ‚Üí Range: 10.10.10.8-11
10.10.10.0/30 ‚Üí Range: 10.10.10.0-3
10.10.10.4/30 ‚Üí Range: 10.10.10.4-7

Kedua router harus dalam range yang sama!

6Ô∏è‚É£ Reset Interface (Jika Semua Gagal)
ciscoRouter(config)#interface serial0/x/x
Router(config-if)#shutdown
Router(config-if)#exit
Router(config)#exit
Tunggu 10 detik
ciscoRouter(config)#interface serial0/x/x
Router(config-if)#no shutdown
Router(config-if)#exit

7Ô∏è‚É£ Verifikasi Clock Rate (DCE Side)
ciscoRouter#show controllers serial0/x/x
```

**Harus terlihat:**
```
DCE V.35, clock rate 64000
Jika tidak ada clock rate:
ciscoRouter(config)#interface serial0/x/x
Router(config-if)#clock rate 64000
Router(config-if)#no shutdown

8Ô∏è‚É£ Cek Konfigurasi Running
ciscoRouter#show running-config
Router#show running-config | section ospf
Router#show running-config | section interface

9Ô∏è‚É£ OSPF Tidak Terbentuk
Cek OSPF Process ID:
ciscoRouter#show ip protocols
Pastikan semua router menggunakan OSPF process ID yang sama (dalam kasus ini: 10)
Cek OSPF Network Statement:
ciscoRouter#show running-config | section ospf

üîü Tips Packet Tracer

Gunakan Mode Simulation untuk melihat packet flow
Tunggu 30-60 detik setelah konfigurasi
Save dan Reload file jika interface tetap down
Pastikan kabel DCE terpasang di router yang benar (F1 dan F3)
Gunakan PPP lebih stabil daripada HDLC di Packet Tracer