! ========================================
! IT-SW CONFIGURATION
! Access Layer Switch - IT Department
! Melbourne Health Services - Project 7
! ========================================

! ========================================
! STEP 1: BASIC SWITCH CONFIGURATION
! ========================================

Switch>enable
Switch#configure terminal

! Set hostname
Switch(config)#hostname IT-SW

! Configure MOTD Banner
IT-SW(config)#banner motd #
************************************************************
*                    WARNING NOTICE                        *
*                                                          *
*   This system is for AUTHORIZED USERS ONLY.              *
*                                                          *
*   Unauthorized access is strictly prohibited.            *
*   All activities are monitored and recorded.             *
*                                                          *
*   Disconnect IMMEDIATELY if you are not authorized.      *
*                                                          *
************************************************************
#

! Disable DNS lookup
IT-SW(config)#no ip domain lookup

! Configure console access
IT-SW(config)#line console 0
IT-SW(config-line)#password cisco
IT-SW(config-line)#login
IT-SW(config-line)#exit

! Configure enable password
IT-SW(config)#enable password cisco

! Encrypt all plaintext passwords
IT-SW(config)#service password-encryption

IT-SW(config)#exit
IT-SW#
%SYS-5-CONFIG_I: Configured from console by console

! Save configuration
IT-SW#write
Building configuration...
[OK]

! ========================================
! STEP 2: TRUNK PORT CONFIGURATION
! ========================================

IT-SW>enable
IT-SW#configure terminal

! Configure trunk ports to Distribution/Core Switch
IT-SW(config)#interface range FastEthernet0/1-2
IT-SW(config-if-range)#switchport mode trunk
IT-SW(config-if-range)#no shutdown
IT-SW(config-if-range)#exit

! ========================================
! STEP 3: ACCESS PORT & VLAN CONFIGURATION
! ========================================

! Configure access ports for IT Department
IT-SW(config)#interface range FastEthernet0/3-24
IT-SW(config-if-range)#switchport mode access
IT-SW(config-if-range)#switchport access vlan 40
IT-SW(config-if-range)#no shutdown
IT-SW(config-if-range)#exit

! Create VLAN 40
IT-SW(config)#vlan 40
IT-SW(config-vlan)#name IT
IT-SW(config-vlan)#exit

! Save configuration
IT-SW(config)#do write
Building configuration...
[OK]

! ========================================
! END OF IT-SW CONFIGURATION
! ========================================

VLAN ID	VLAN Name	Port Range	Mode
40	IT	Fa0/3 â€“ Fa0/24	Access
Trunk	â€”	Fa0/1 â€“ Fa0/2	Trunk
ğŸŒ IT-SW PORT TOPOLOGY
               â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
               â”‚     IT-SW       â”‚
               â”‚  Access Switch  â”‚
               â””â”€â”€â”€â”€â”€â”€â”€â”¬â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜
                       â”‚
          â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”¼â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
          â”‚                         â”‚
     Fa0/1 (TRUNK)            Fa0/2 (TRUNK)
          â”‚                         â”‚
   â”Œâ”€â”€â”€â”€â”€â”€â–¼â”€â”€â”€â”€â”€â”€â”           â”Œâ”€â”€â”€â”€â”€â”€â–¼â”€â”€â”€â”€â”€â”€â”
   â”‚Dist/Core SW â”‚           â”‚Dist/Core SW â”‚
   â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜           â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜

   Fa0/3 â€“ Fa0/24
   VLAN 40 (IT Department)

ğŸ” CONFIGURATION DETAILS
Item	Value
Switch Role	Access Layer
Department	IT
VLAN ID	40
Trunk Ports	Fa0/1â€“Fa0/2
Access Ports	Fa0/3â€“Fa0/24
Security	Console + Enable Password
ğŸ§ª VERIFICATION COMMANDS
1ï¸âƒ£ Check VLAN
IT-SW#show vlan brief

2ï¸âƒ£ Check Trunk Ports
IT-SW#show interfaces trunk

3ï¸âƒ£ Check Interface Status
IT-SW#show ip interface brief

4ï¸âƒ£ Check Running Config
IT-SW#show running-config
