
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname ICT-SW
ICT-SW(config)#banner motd #
Enter TEXT message.  End with the character '#'.
************************************************************
*                    WARNING NOTICE                        *
*                                                          *
*   This system is for AUTHORIZED USERS ONLY.              *
*                                                          *
*   Unauthorized access is strictly prohibited.            *
*   All activities are monitored and recorded.             *
*                                                          *
*   Disconnect IMMEDIATELY if you are not authorized.      *
*                                                          *
************************************************************
#

ICT-SW(config)#line console 0
ICT-SW(config-line)#password cisco
ICT-SW(config-line)#login
ICT-SW(config-line)#exit
ICT-SW(config)#enable password cisco
ICT-SW(config)#service password-encryption
ICT-SW(config)#exit
ICT-SW#
%SYS-5-CONFIG_I: Configured from console by console

ICT-SW#wr
Building configuration...
[OK]
ICT-SW#

==============================================

ICT-SW#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
ICT-SW(config)#int range fa0/1-2
ICT-SW(config-if-range)#switchport mode trunk


ICT-SW(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

ICT-SW(config-if-range)#exit
ICT-SW(config)#vlan 50
ICT-SW(config-vlan)#name ICT
ICT-SW(config-vlan)#exit
ICT-SW(config)#int range fa0/3-24
ICT-SW(config-if-range)#switchport mode access
ICT-SW(config-if-range)#switchport access vlan 50
ICT-SW(config-if-range)#exit
ICT-SW(config)#
ICT-SW(config)#do wr
Building configuration...
[OK]
ICT-SW(config)#
ICT-SW(config)#vlan 99
ICT-SW(config-vlan)#name BlackHole
ICT-SW(config-vlan)#exit
ICT-SW(config)#int range gig0/1-2
ICT-SW(config-if-range)#switchport mode access
ICT-SW(config-if-range)#switchport access vlan 99
ICT-SW(config-if-range)#shutdown

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down

%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down
ICT-SW(config-if-range)#exit
ICT-SW(config)#do wr
Building configuration...
[OK]
ICT-SW(config)#