
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname Sales-Sw
Sales-Sw(config)#banner motd #
Enter TEXT message.  End with the character '#'.
************************************************************
*                    WARNING NOTICE                        *
*                                                          *
*   This system is for AUTHORIZED USERS ONLY.              *
*                                                          *
*   Unauthorized access is strictly prohibited.            *
*   All activities are monitored and recorded.             *
*                                                          *
*   Disconnect IMMEDIATELY if you are not authorized.      *
*                                                          *
************************************************************
#

Sales-Sw(config)#no ip domain lookup
Sales-Sw(config)#line console 0
Sales-Sw(config-line)#password cisco
Sales-Sw(config-line)#login
Sales-Sw(config-line)#exit
Sales-Sw(config)#
Sales-Sw(config)#enable password cisco
Sales-Sw(config)#service password-encryption
Sales-Sw(config)#exit
Sales-Sw#wr
Building configuration...
[OK]
Sales-Sw#

==============================================

Sales-Sw(config)#int range fa0/1-2
Sales-Sw(config-if-range)#switchport mode trunk


Sales-Sw(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

Sales-Sw(config-if-range)#exit
Sales-Sw(config)#
Sales-Sw(config)#
Sales-Sw(config)#
Sales-Sw(config)#vlan 10
Sales-Sw(config-vlan)#name Sales
Sales-Sw(config-vlan)#exit
Sales-Sw(config)#
Sales-Sw(config)#int range fa0/3-24
Sales-Sw(config-if-range)#switchport mode access
Sales-Sw(config-if-range)#switchport access vlan 10
Sales-Sw(config-if-range)#exit
Sales-Sw(config)#
Sales-Sw(config)#do wr
Building configuration...
[OK]
Sales-Sw(config)#vlan 99
Sales-Sw(config-vlan)#name BlackHole
Sales-Sw(config-vlan)#exit
Sales-Sw(config)#int range gig0/1-2
Sales-Sw(config-if-range)#switchport mode access
Sales-Sw(config-if-range)#switchport access vlan 99
Sales-Sw(config-if-range)#shutdown

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down

%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down
Sales-Sw(config-if-range)#exit
Sales-Sw(config)#do wr
Building configuration...
[OK]
Sales-Sw(config)#
