
Switch>enable
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SERVER-SW
SERVER-SW(config)#banner motd #
Enter TEXT message.  End with the character '#'.
************************************************************
*                    WARNING NOTICE                        *
*                                                          *
*   This system is for AUTHORIZED USERS ONLY.              *
*                                                          *
*   Unauthorized access is strictly prohibited.            *
*   All activities are monitored and recorded.             *
*                                                          *
*   Disconnect IMMEDIATELY if you are not authorized.      *
*                                                          *
************************************************************
#

SERVER-SW(config)#line console 0
SERVER-SW(config-line)#password cisco
SERVER-SW(config-line)#login
SERVER-SW(config-line)#exit
SERVER-SW(config)#enable password cisco
SERVER-SW(config)#service password-encryption
SERVER-SW(config)#exit
SERVER-SW#
%SYS-5-CONFIG_I: Configured from console by console

SERVER-SW#wr
Building configuration...
[OK]
SERVER-SW#

===================================================

SERVER-SW>en
Password: 
SERVER-SW#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SERVER-SW(config)#int range fa0/1-2
SERVER-SW(config-if-range)#switchport mode trunk


SERVER-SW(config-if-range)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up

SERVER-SW(config-if-range)#exit
SERVER-SW(config)#
SERVER-SW(config)#vlan 60
SERVER-SW(config-vlan)#name Server
SERVER-SW(config-vlan)#exit
SERVER-SW(config)#
SERVER-SW(config)#int range fa0/3-24
SERVER-SW(config-if-range)#switchport mode access
SERVER-SW(config-if-range)#switchport access vlan 60
SERVER-SW(config-if-range)#exit
SERVER-SW(config)#
SERVER-SW(config)#vlan 99
SERVER-SW(config-vlan)#name BlackHole
SERVER-SW(config-vlan)#exit
SERVER-SW(config)#int range gig0/1-2
SERVER-SW(config-if-range)#switchport mode access
SERVER-SW(config-if-range)#switchport access vlan 99
SERVER-SW(config-if-range)#shutdown

%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down

%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down
SERVER-SW(config-if-range)#
SERVER-SW(config-if-range)#exit
SERVER-SW(config)#do wr
Building configuration...
[OK]
SERVER-SW(config)#